/// DOM

//  ПОДІЇ

/*
Два важливих принципи:

1. Все, що нас оточує - це об'єкти.
Об'єкт змінюється за посиланням (і передається теж), вплив на об'єкт змінює той елемент, який цим об'єктом представлений.
У об'єктів є властивості та методи.
Об'єкти можуть ділитися властивостями та методами зі своїми нащадками за допомогою прототипного наслідування

2. На сторінці стаються події.

Подія - (англ. event) - це певна дія (зміна чогось), що може відбутись на сторінці.
Події можуть бути: 
    - згенерованими користувачем (рухи мишею, клацання, набір тексту на клавіатурі)
    - станом сторінки
    - у відповідь на запити на сервер

Реакція на подію наз. обробкою події.

Для того, щоби пояснити браузеру, що ми очікуємо певної події, ми на неї "підписуємось"


*/


/*
Зробити п'ять кнопок, які за натиснення виводять текст, що на них написаний, в консоль і знімають з себе обробку події натиснення


*/


const btns = document.querySelectorAll('button');

for (const btn of btns) {
    btn.addEventListener('click', clickHandler)    
}

function clickHandler(event) {
 //   const {target: btn} = event;
    console.log(event.target.textContent);
    event.target.removeEventListener('click', clickHandler)
}