/// DOM

//  ПОДІЇ

/*
Два важливих принципи:

1. Все, що нас оточує - це об'єкти.
Об'єкт змінюється за посиланням (і передається теж), вплив на об'єкт змінює той елемент, який цим об'єктом представлений.
У об'єктів є властивості та методи.
Об'єкти можуть ділитися властивостями та методами зі своїми нащадками за допомогою прототипного наслідування

2. На сторінці стаються події.

Подія - (англ. event) - це певна дія (зміна чогось), що може відбутись на сторінці.
Події можуть бути: 
    - згенерованими користувачем (рухи мишею, клацання, набір тексту на клавіатурі)
    - станом сторінки
    - у відповідь на запити на сервер

Реакція на подію наз. обробкою події.

Для того, щоби пояснити браузеру, що ми очікуємо певної події, ми на неї "підписуємось"


*/

const btn = document.querySelector('button');

const handler = function(event) {
    console.log(event);
}
const secondHandler = function(event) {
    console.log('THIS IS MY SECOND HANDLER');
    event.target.removeEventListener('click', handler);
}

btn.addEventListener('click', handler);
btn.addEventListener('click', secondHandler);

//btn.addEventListener('mouseover', handler);
btn.addEventListener('contextmenu', handler);



/*
Підписка на подію повідомляє браузеру, що ми хочемо відреагувати на щось конкретне, якщо і коли воно станеться
Браузер викликає обробник події та передає йому у аргументи об'єкт події, що сталася


Для відписки від події мені потрібно повідомити браузеру, що ця подія мені не потрібна.

*/
