// DOM

/*
Document
Object
Model

(Об'єктна модель документа) - це представлення документу як набору елементів-об'єктів, інтерфейс для взаємодії з документом.

Вхідна точка DOM - document

*/

/*
Два важливих принципи:

1. Все, що нас оточує - це об'єкти.
Об'єкт змінюється за посиланням (і передається теж), вплив на об'єкт змінює той елемент, який цим об'єктом представлений.
У об'єктів є властивості та методи.
Об'єкти можуть ділитися властивостями та методами зі своїми нащадками за допомогою прототипного наслідування


*/

const articlesHTMLCollection = document.getElementsByTagName('article');

const articlesNodeList = document.querySelectorAll('article');

/*
HTMLCollection - "жива" колекція.
При видаленні (або створенні нових елементів) формує актуальний список посилань на елементи (при видаленні буде зі списку видаляти їх, при створенні додавати)

NodeList - статична колекція, один раз сформований список не зміниться, якщо елементи будуть видалені або додані

Якщо потрібно оновити список елементів - можна перевикликати querySelectorAll і перестворити NodeList заново
*/