// DOM

/*
Document
Object
Model

(Об'єктна модель документа) - це представлення документу як набору елементів-об'єктів, інтерфейс для взаємодії з документом.

Вхідна точка DOM - document

*/

/*
Два важливих принципи:

1. Все, що нас оточує - це об'єкти.
Об'єкт змінюється за посиланням (і передається теж), вплив на об'єкт змінює той елемент, який цим об'єктом представлений.
У об'єктів є властивості та методи.
Об'єкти можуть ділитися властивостями та методами зі своїми нащадками за допомогою прототипного наслідування


*/


/*
Створення елементів:

1. Створити об'єкт потрібного елемента
2. Вказати батьківському елементу, що цей стане його дитиною
    Для цього потрібно мати доступ до елемента (батька), який вже є на сторінці

*/


/*
Створити пусту сторінку (без елементів).
Динамічно створити секцію, всередині якої параграф і кнопка. В параграфі та кнопці довільний текст

*/

const body = document.body;

const p = document.createElement('p');
p.textContent = 'Довільний текст';

const btn = document.createElement('button');
btn.textContent = 'Клацни мене';

const section = document.createElement('section');
section.append(p, btn);

body.append(section);