/// DOM

//  ПОДІЇ

/*
Два важливих принципи:

1. Все, що нас оточує - це об'єкти.
Об'єкт змінюється за посиланням (і передається теж), вплив на об'єкт змінює той елемент, який цим об'єктом представлений.
У об'єктів є властивості та методи.
Об'єкти можуть ділитися властивостями та методами зі своїми нащадками за допомогою прототипного наслідування

2. На сторінці стаються події.

Подія - (англ. event) - це певна дія (зміна чогось), що може відбутись на сторінці.
Події можуть бути: 
    - згенерованими користувачем (рухи мишею, клацання, набір тексту на клавіатурі)
    - станом сторінки
    - у відповідь на запити на сервер

Реакція на подію наз. обробкою події.

Для того, щоби пояснити браузеру, що ми очікуємо певної події, ми на неї "підписуємось"


*/

const button = document.querySelector('button');

button.addEventListener('click', clicker);


function clicker(event){   /* Функція eventHandler - обробник події  */
   console.log(event);
}

/*
Підписка на подію повідомляє браузеру, що ми хочемо відреагувати на щось конкретне, якщо і коли воно станеться
Браузер викликає обробник події та передає йому у аргументи об'єкт події, що сталася

*/